c5/src/Catalogs/Currencies/Currencies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Currencies</name>
  <attributes>
    <name>Download</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GenderFractionalRo</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>GenderFractionalRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GenderIntRo</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>GenderIntRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NominativeFractionalRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NominativeIntRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OptionsEn</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OptionsRo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OptionsRu</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PlurarFractionalEn</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PlurarFractionalRo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PlurarFractionalRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PlurarIntEn</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PlurarIntRo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PlurarIntRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SingularFractionalEn</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SingularFractionalRo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SingularFractionalRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SingularIntEn</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SingularIntRo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SingularIntRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Catalogs/Currencies/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtClient
Procedure OnOpen ( Cancel )
	
	AmountEn = 9561.83;
	AmountRo = AmountEn;
	AmountRu = AmountEn;
	setExampleRo ();
	setExampleRu ();
	setExampleEn ();
	
EndProcedure

&AtClient
Procedure setExampleRo () 

	InWordsRo = NumberInWords ( AmountRo, "L=ro_Ro; FS=false", Object.OptionsRo );

EndProcedure

&AtClient
Procedure setExampleRu () 

	InWordsRu = NumberInWords ( AmountRu, "L=ru_RU; FS=false", Object.OptionsRu );

EndProcedure

&AtClient
Procedure setExampleEn () 

	InWordsEn = NumberInWords ( AmountEn, "L=en_En; FS=false", Object.OptionsEn );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure OptionsRoOnChange ( Item )
	
	setOptionsRo ();
	setExampleRo ();
	
EndProcedure

&AtClient
Procedure setOptionsRo () 

	Object.OptionsRo = TrimAll ( Object.SingularIntRo ) + ", " + TrimAll ( Object.PlurarIntRo ) + ", " + gender ( Object.GenderIntRo ) + ", " 
	+ TrimAll ( Object.SingularFractionalRo ) + ", " + TrimAll ( Object.PlurarFractionalRo ) + ", " + gender ( Object.GenderFractionalRo );

EndProcedure

&AtClient
Function gender ( Gender ) 

	return ? ( Gender = PredefinedValue ( "Enum.Sex.Male" ), "M", "W" );

EndFunction

&AtClient
Procedure OptionsEnOnChange ( Item )
	
	setOptionsEn ();
	setExampleEn ();
	
EndProcedure

&AtClient
Procedure setOptionsEn () 

	Object.OptionsEn = TrimAll ( Object.SingularIntEn ) + ", " + TrimAll ( Object.PlurarIntEn ) + ", " + TrimAll ( Object.SingularFractionalEn ) 
	+ ", " + TrimAll ( Object.PlurarFractionalEn );

EndProcedure

&AtClient
Procedure AmountRoOnChange ( Item )
	
	setExampleRo ();
	
EndProcedure

&AtClient
Procedure AmountEnOnChange ( Item )
	
	setExampleEn ();
	
EndProcedure

&AtClient
Procedure OptionsRuOnChange ( Item )
	
	setOptionsRu ();
	setExampleRu ();
	
EndProcedure

&AtClient
Procedure setOptionsRu () 

	Object.OptionsRu = TrimAll ( Object.NominativeIntRu ) + ", " + TrimAll ( Object.SingularIntRu ) + ", " 
	+ TrimAll ( Object.PlurarIntRu ) + ", " + Object.GenderIntRu + ", " + TrimAll ( Object.NominativeFractionalRu ) + ", " 
	+ TrimAll ( Object.SingularFractionalRu ) + ", " + TrimAll ( Object.PlurarFractionalRu ) + ", " + Object.GenderFractionalRu;

EndProcedure

&AtClient
Procedure AmountRuOnChange ( Item )
	
	setExampleRu ();
	
EndProcedure
